Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/edc/PIC32CM1216LS00064.PIC
      <edc:SFRDef edc:_addr="0x4200344C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CC2" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003450" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CC3" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003454" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x42003464" edc:access="nnnnnnnnnnnnnnnn" edc:cname="PATTBUF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TCC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="PGEB0" edc:desc="Pattern Generation 0 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB1" edc:desc="Pattern Generation 1 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB2" edc:desc="Pattern Generation 2 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB3" edc:desc="Pattern Generation 3 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB4" edc:desc="Pattern Generation 4 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB5" edc:desc="Pattern Generation 5 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB6" edc:desc="Pattern Generation 6 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB7" edc:desc="Pattern Generation 7 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB0" edc:desc="Pattern Generation 0 Output Value Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB1" edc:desc="Pattern Generation 1 Output Value Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB2" edc:desc="Pattern Generation 2 Output Value Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB3" edc:desc="Pattern Generation 3 Output Value Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB4" edc:desc="Pattern Generation 4 Output Value Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB5" edc:desc="Pattern Generation 5 Output Value Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB6" edc:desc="Pattern Generation 6 Output Value Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB7" edc:desc="Pattern Generation 7 Output Value Buffer" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003466" edc:offset="0x6"/>
      <edc:SFRDef edc:_addr="0x4200346C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PERBUF" edc:impl="0xFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="TCC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003470" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCBUF0" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
