Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/edc/PIC32CM1216LS00064.PIC
      <edc:SFRDef edc:access="--------nn----n-nnn---n--n---nnn" edc:addr="0x42001404" edc:cname="CTRLB" edc:impl="0xC2E247" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="CHSIZE" edc:desc="Character Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="8_BIT" edc:desc="8 bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="9_BIT" edc:desc="9 bits" edc:when="(field &amp; 0x7) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PLOADEN" edc:desc="Data Preload Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SSDE" edc:desc="Slave Select Low Detect Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="SS low detector is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="SS low detector is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MSSEN" edc:desc="Master Slave Select Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Hardware SS control is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Hardware SS control is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AMODE" edc:desc="Address Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="ADDRMASK is used as a mask to the AADR register" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2ADDRS" edc:desc="The slave responds to the two unique addresses in ADDR and ADDRMASK" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RANGE" edc:desc="The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FIFOCLR" edc:desc="FIFO Clear" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TXFIFO" edc:desc="Clear TX FIFO" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RXFIFO" edc:desc="Clear RX FIFO" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Clear both TX and RF FIFOs" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------nnnnnnnn--------nnnnnnnn" edc:addr="0x42001424" edc:cname="ADDR" edc:impl="0xFF00FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address Value" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="ADDRMASK" edc:desc="Address Mask" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnn--n------------------nnnnnn" edc:addr="0x42001408" edc:cname="CTRLC" edc:impl="0xF900003F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="ICSPACE" edc:desc="Inter-Character Spacing" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="DATA32B" edc:desc="Data 32 Bit" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FIFOEN" edc:desc="FIFO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTRHOLD" edc:desc="Receive FIFO Threshold" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Interrupt and DMA triggers are generated when DATA is present in the FIFO" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Interrupt and DMA triggers are generated when FIFO is half-full" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="Interrupt and DMA triggers are generated when FIFO is full" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXTRHOLD" edc:desc="Transmit FIFO Threshold" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Interrupt and DMA triggers are generated as long as the FIFO is not full" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Interrupt and DMA triggers are generated when half FIFO space is free" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EMPTY" edc:desc="Interrupt and DMA triggers are generated as long as the FIFO is empty" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x42001428" edc:cname="DATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4200140C" edc:cname="BAUD" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="BAUD" edc:desc="Baud Rate Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n" edc:addr="0x42001430" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="DBGSTOP" edc:desc="Debug Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n---nnnn" edc:addr="0x42001414" edc:cname="INTENCLR" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSL" edc:desc="Slave Select Low Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---rrrrr---rrrrr" edc:addr="0x42001434" edc:cname="FIFOSPACE" edc:impl="0x1F1F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="TXSPACE" edc:desc="Tx FIFO Empty Space" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RXSPACE" edc:desc="Rx FIFO Filled Space" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
